/*
	(C) 2016 hikarimo
*/

#include "hl_common.h"
#include "hl_rl78g13_wdt.h"
#include "hl_rl78g13_i2c.h"
#include "hl_rl78g13_uart.h"

static void clock_Setup(void);
static void port_Setup(void);

/*
	ハードウェア設定
*/
void hdwinit(void)
{
	/* 割り込み禁止 */
	DI();

	/* 周辺I/Oリダイレクション・レジスタ */
	/*
	    7     6     5     4     3     2     1     0
	+-----+-----+-----+-----+-----+-----+-----+-----+
	|  0  |  0  |PIOR5|PIOR4|PIOR3|PIOR2|PIOR1|PIOR0|
	+-----+-----+-----+-----+-----+-----+-----+-----+
	  「RL78/G13 ユーザーズマニュアル ハードウェア編」
	  4.3.8 周辺I/Oリダイレクション・レジスタ(PIOR)
	*/
	PIOR = 0x00;

	/* 各種設定 */
	clock_Setup();
	port_Setup();
/*	WDT_Setup();*/
/*	CMT_Setup_CMT0();*/
	I2C_Setup_IIC01(50);
	Uart_Setup_IIC00(115200);
/*	I2C_Start_RIIC0();*/
/*	Setup_IRQ();*/
}
/*
	クロック設定
*/
void clock_Setup(void)
{
	/* クロック動作モード制御レジスタ(CMC) */
	/*
	    7       6       5       4       3       2       1       0
	+-------+-------+-------+-------+-------+-------+-------+-------+
	| EXCLK | OSCSEL| EXCLKS|OSCSELS|   0   | AMPHS1| AMPHS0|  AMPH |
	+-------+-------+-------+-------+-------+-------+-------+-------+
	EXCLK/OSCSEL(高速システム・クロック端子の動作モード、X1/P121端子、X2/EXCLK/P122端子)
	  00: 入力ポート・モード(P121、P122は入力ポート)
	  01: X1発信モード(P121、P122は、水晶/セラミック発信子接続)
	  10: 入力ポート・モード(P121、P122は入力ポート)
	  11: 外部クロックモード(P121は入力ポート、P122は外部クロック入力)
	EXCLKS/OSCSELS(サブシステム・クロック端子の動作モード、XT1/P123端子、XT2/EXCLKS/P124端子)
	  00: 入力ポート・モード(P123、P124は入力ポート)
	  01: XT1発信モード(P123、P124は水晶発振子接続)
	  10: 入力ポート・モード(P123、P124は入力ポート)
	  11: 外部クロック入力・モード(P123は入力ポート、P124は外部クロック入力)
	AMPHS1/AMPHS0(XT1発振回路の発振モード選択)
	  00: 低消費発信
	  01: 通常発信
	  10: 超低消費発信
	  11: 設定禁止
	AMPH(X1クロック発振周波数の制御
	  0 : 1MHz≦fx≦10MHz
	  1 : 10MHz≦fx≦20MHz
	※リセット解除後、8ビット・メモリ操作命令で1回のみ書き込み可能
	*/
	CMC = 0x00;		/* P121、P122、P123、P124を入力ポートに設定 */

	/*システム・クロック制御レジスタ(CKC) */
	/*
	    7       6       5       4       3       2       1       0
	+-------+-------+-------+-------+-------+-------+-------+-------+
	|  CLS  |  CSS  |  MCS  |  MCM0 |   0   |   0   |   0   |   0   |
	+-------+-------+-------+-------+-------+-------+-------+-------+
	CLS(CPU/周辺ハードウェア・クロック(fCLK)のステータス)(リードオンリー)
	  0 : メイン・システム・クロック(fMAIN)
	  1: サブ・システム・クロック(fSUB)
	CSS(CPU/周辺ハードウェア・クロック(fCLK)の選択)
	  0 : メイン・システム・クロック(fMAIN)
	  1 : サブ・システム・クロック(fSUB)
	MCS(メイン・システム・クロック(fMAIN)のステータス)(リードオンリー)
	  0 : 高速オンチップ・オシレータ・クロック(fIH)
	  1 : 高速システム・クロック(fMX)
	MCM0(メイン・システム・クロック(fMAIN)の動作制御
	  0 : メイン・システム・クロック(fMAIN)に高速オンチップ・オシレータ・クロック(fIH)を選択
	  1 : メイン・システム・クロック(fMAIN)に高速システム・クロック(fMX)を選択
	*/
	CSS = 0u;		/* メイン・システム・クロック選択 */
	MCM0 = 0u;		/* メイン・システム・クロック(fMAIN)に高速オンチップ・オシレータ・クロック(fIH)を選択 */

	/* クロック動作ステータス制御レジスタ(CSC) */
	/*
	    7       6       5       4       3       2       1       0
	+-------+-------+-------+-------+-------+-------+-------+-------+
	| MSTOP | XTSTOP|   0   |   0   |   0   |   0   |   0   |HIOSTOP|
	+-------+-------+-------+-------+-------+-------+-------+-------+
	MSTOP(高速システム・クロックの動作制御
	  0 : X1発振回路動作、EXCLK端子からの外部クロック有効
	  1 : X1発振回路停止、EXCLK端子からの外部クロック無効
	XTSTOP(サブシステム・クロックの動作制御)
	  0 : XT1発振回路動作、EXCLKS端子からの外部クロック有効
	  1 : XT1発振回路停止、EXCLKS端子からの外部クロック無効
	HIOSTOP(高速オンチップ・オシレータ・クロックの動作制御
	  0 : 高速オンチップ・オシレータ動作
	  1 : 高速オンチップ・オシレータ停止
	*/
	MSTOP = 1u;		/* X1発信回路動作/外部クロック無効 */
	XTSTOP = 1u;	/* XT1発信回路動作/外部クロック無効 */
	HIOSTOP = 0u;	/* 高速オンチップ・オシレータ動作 */

	/* 発振安定時間カウンタ状態レジスタ(OSTC) */
	/*
	    7       6       5       4       3       2       1       0
	+-------+-------+-------+-------+-------+-------+-------+-------+
	| MOST8 | MOST9 | MOST10| MOST11| MOST13| MOST15| MOST17| MOST18|
	+-------+-------+-------+-------+-------+-------+-------+-------+
	X1クロックの発振安定時間カウンタのカウント状態を示す。
	必要ならこのレジスタを見て発振が安定するのを待つ
	*/

	/* 発振安定時間選択レジスタ(OSTS) */
	

	/* サブシステム・クロック供給モード制御レジスタ(OSMC) */
	/*
	    7       6       5       4       3       2       1       0
	+-------+-------+-------+-------+-------+-------+-------+-------+
	| RTCLPC|   0   |   0   |WUTMMCK0|  0   |   0   |   0   |   0   |
	+-------+-------+-------+-------+-------+-------+-------+-------+
	RTCLPC(STOPモードジおよびサブシステム・クロックでCPU動作中のHALTモード時の設定
	  0 : 周辺機能へのサブシステム・クロック供給許可
	  1 : リアルタイム・クロック、12ビット・インターバル・タイマ以外の周辺機能へのサブ・クロック供給停止
	WUTMMCK0(リアルタイム・クロック、12ビット・インターバル・タイマのカウント・クロックの選択)
	  0 : サブシステム・クロック
	  1 : 低速オンチップ・オシレータ・クロック
	*/
	OSMC = 0x10;

	/* 高速オンチップ・オシレータの周波数 */
	/*   hl_rl78g13_obtbyte.asm(00C2/10C2番地)で設定 */
}
/*
	ポート設定
*/
void port_Setup(void)
{
	/* I/Oポート */
	/* ポート・モード・レジスタ(PMx) */
	/*
	  0 : 出力モード
	  1 : 入力モード
	*/
	PM0 = 0xfe;

	/* プルアップ抵抗オプション・レジスタ(PUx) */
	/*
	  0 : 内蔵プルアップ抵抗を接続しない
	  1 : 内蔵プルアップ抵抗を接続する
	*/
	PU0 = 0x00;

	/* ポート入力モード・レジスタ(PIMx) */
	/*
	  0 : 通常入力バッファ
	  1 : TTL入力バッファ
	*/
	PIM0 = 0x00;

	/* ポート出力モード・レジスタ(POMx) */
	/*
	  0 : 通常出力モード
	  1 : N-chオープン・ドレイン出力
	*/
	POM0 = 0x00;

	/* ポート・モード・コントロール・レジスタ(PMCx) */
	/*
	  0 : デジタル入出力(アナログ入力以外の兼用機能)
	  1 : アナログ入力
	※非搭載ビットは初期値(0xff)を設定する
	*/
	PMC0 = 0xff;
}
