/*
	(C) 2016 hikarimo
*/

#pragma interrupt INTTM00 TIMER_TAU0_CH0_IntervalInterrupt

#include "hl_common.h"
#include "hl_rl78g13_timer.h"

/*
	インターバル・タイマ設定
*/
void TIMER_Setup_TAU0(void)
{
	// 周辺イネーブル・レジスタ
	TAU0EN = 1u;		// 0:クロック供給停止、1:供給
	// タイマ・クロック選択レジスタ
	TPS0 = 0x0;			// 0:fCLK、1:fCLK/2、2:fCLK/4、3:fCLK/8、
						// 4:fCLK/16、5:fCLK/32、6:fCLK/64、7:fCLK/128、
						// 8:fCLK/256、9:fCLK/512、10:fCLK/1024、11:fCLK/2048、
						// 12:fCLK/4096、13:fCLK/8192、14:fCLK/16384、15:fCLK/32768

	// サブシステム・クロック供給モードレジスタ(OSMC)
	//   hl_rl78g13_hwsetup.c(clockSetup関数)で設定

	// タイマ・チャンネル停止レジスタ
	TT0 = 0xff;			// b15-12: 0固定
						// b11: 0:チャネル3の上位側8ビット・タイマのトリガ動作しない、1:する
						// b10: 0固定
						// b9:  0:チャネル1の上位側8ビット・タイマのトリガ動作しない、1:する
						// b8:  0固定
						// b7-b0: 

	TMMK00 = 1u;		// 0:割り込み処理許可、1:禁止
	TMIF00 = 0u;		// 割り込みフラグ初期化

	// 
	TMPR000 = 1u;		// 0,1 割り込み優先レベルの選択
	TMPR100 = 1u;		//   00:レベル0(高優先順位)
						//   01:レベル1
						//   10:レベル2
						//   11:レベル3(低優先順位)

	// タイマ・モード・レジスタ
	TMR00 = 0;			// b15-14: 動作クロック選択
						//   00: CK00を選択
						//   01: CK02を選択
						//   10: CK01を選択
						//   11: CK03を選択
						// b13: 0固定
						// b12: 0:動作クロックを使用、1:TI00端子からの入力信号を使用
						// b11: チャネル2,4,6の場合
						//      0:独立チャネル動作、1:複数チャネル連動でマスタ・チャンネルとして動作
						// b11: チャネル1,3の場合
						//      0:16ビット・タイマとして動作(単独、または連動動作のスレーブ)、1:8ビット・タイマとして動作
						// b11: チャネル0,5,7の場合 0固定
						// b10-b8: スタート・トリガ、キャプチャ・トリガ
						//   000: 

	TDR00 = 3200u;		// タイマ・データ・レジスタ(インターバル時間)
						//   32MHzで100usにするなら、3200になる。

	TO0 &= ~(1u);		// b15-b8: 0固定
						//  b7-b0: 0:チャネル7～0のタイマ出力端子の出力値は0、1:1

	TOE0 &= ~(1u);		// b15-b8: 0固定
						//  b7-b0: 0:TO7～0の操作許可、1:禁止
}

/*
	インターバル・タイマ開始
*/
void TIMER_Start_TAU0_CH0(void)
{
	TMIF00 = 0u;		// 
	TMMK00 = 0u;		// 
	TS0 |= 1u;			// タイマ・チャネル開始レジスタ
}
/*
	インターバル・タイマ停止
*/
void TIMER_Stop_TAU0_CH0(void)
{
	TT0 |= 1u;
	TMMK00 = 1u;
	TMIF00 = 0u;
}
/*
	インターバル・タイマの割り込みハンドラ
*/
__interrupt static void TIMER_TAU0_CH0_IntervalInterrupt(void)
{
	static unsigned char c = 0;

	// ここに処理を書く
	c = !c;
	P0.0 = c;
}
